//Реализовать множество (set) с помощью TreeMap. +
//Создать метод add, добавляющий элемент в ваше множество. +
//Объявить и инициализировать компаратор с обратной (от большего к меньшеиу) логикой сортировки чисел.
// Объявить и инициализировать TreeSet использующий ваш компаратор.
//Добавить несколько эллементов в сет и вывести в консоль. +

/*package home_work_lesson_6;

/*public class main_1 {

    public static void main(String[] args) {

        class_1.methAdd(5, 10);
        class_1.methAdd(10, 21);
        class_1.methAdd(3, 1);
        class_1.methAdd(1, 25);
        System.out.println(class_1.metSize());
        class_1.metPrint();

        TreeMap<Integer, Integer> tree_2 = new TreeMap<Integer, Integer>();
        tree_2.put(1, 3);
        tree_2.put(3, 1);
        tree_2.put(5, 6);
        tree_2.put(7, 9);
        tree_2.forEach((key, value)-> System.out.println(key + " " + value));

        Comparator<Integer> c = new Comparator<>()

        {
            @Override
            public int compare(Integer class_1, Integer tree_2) {
                return 0;
            }
         };

    }
}*/
