
//Создать новый список, добавить несколько строк и вывести коллекцию на экран


package home_work_3;

import java.util.ArrayList;

public class task_1 {
    public static void main(String[] args) {
        ArrayList<String> array1 = new ArrayList<>();

        array1.add("Hello");
        array1.add("World");
        array1.add("hello");
        System.out.println(array1);
    }
}